
public class Index {

//	자바 기초 프로그래밍 강좌 12강 - 반복 함수와 재귀 함수 ② (Java Programming Tutorial 2017 #12)
//	https://www.youtube.com/watch?v=2fsJ6Hlcfs4&list=PLRx0vPvlEmdBjfCADjCc41aD4G0bmdl4R&index=12
//
//	반복 함수와 재귀 함수
//	반복의 묘미
//	반복 함수는 단순히 while 혹은 for 문법을 이용하여 특정한 처리를 반복하는 방식으로 문제를 해결하는 함수 입니다.
//	반면에 재귀 함수는 자신의 함수 내부에서 자기 자신을 스스로 호출함으로써 재귀적으로 문제를 해결하는 함수입니다.
//	재귀 함수는 경우에 따라서는 아주 간결하고 직관적인 코드로 문제를 해결할 수 있게 해주지만
//	때에 따라서는 심각한 비효율성을 낳을 수 있기 때문에 알고리즘을 작성할 때 유의할 필요가 있습니다.
//
//	반복 함수와 재귀 함수
//	반복의 묘미
//	반복 함수와 재귀 함수를 이용하여 다양한 프로그램을 작성해봅니다.
//	- 팩토리얼을 재귀 함수로 구현할 수 있습니다.
//	- 팩토리얼을 반복 함수로 구현할 수 있습니다.
//	- 피보나치 수열을 재귀 함수로 구현할 수 있습니다.
//	- 피보나치 수열을 반복 함수로 구현할 수 있습니다.
	
}
