
public class Index {
	
//	자바 기초 프로그래밍 강좌 7강 - 기본 입출력(Input & Output) (Java Programming Tutorial 2017 #7)
//	https://www.youtube.com/watch?v=Jmrx1h8Ba0M&list=PLRx0vPvlEmdBjfCADjCc41aD4G0bmdl4R&index=7


//	여기서 잠깐!
//	조건문 & 반복문
//	- 하나의 비교 연산자는 true 혹은 false를 반환하게 됩니다.
//	- 모든 조건문 반복문에서는 왠만하면 무조건 괄호를 적용하세요
//	- for문 혹은 while문은 얼마든지 중첩될 수 있습니다.
//	- for(;;)는 while(true)와 똑같이 무한 루프라는 의미로 동작합니다.
//	- break;를 이용하여 반복문을 즉시 빠져나올 수 있습니다.

//	기본 입출력
//	사용자와의 상호작용
//	자바에서는 대표적으로 Scanner() 함수를 이용하여 사용자와 상호작용할 수 있습니다.
//	일반적으로 Scanner sc = new Scanner(System.in); 으로 클래스 객체를 생성한 뒤
//	에 sc nextInt(); 와 같은 방법으로 int형을 입력받을 수 있습니다.
//	입력 받은 자료는 내부적으로 어떠한 처리를 한 뒤에 다시 사용자게에 그 값을 반환할 수 있습니다.
//	프로그램이 입출력을 잘 지원한다는 것은 사용자 인터페이스가 뛰어나다는 의미와 같습니다.
//	나중에 GUII를 배우게 되면 이러한 입출력을 훨씬 용이하게 할 수 있답니다.

//	기본 입출력
//	반드시 숙지하기
//	앞서 배운 내용들에 Scanner 클래스를 이용하여 다양한 프로그램을 작성합니다.
//	- 특정한 정수를 입력 받아서 그대로 출력하는 프로그램을 작성해봅시다.
//	- 파일에 차례로 입력된 모든 정수에 100을 곱해 출력하는 프로그램을 작성해봅시다.
//	- 1단부터 9단까지 구구단을 출력하는 프로그램을 작성해봅시다.


}
