
public class Index {

//	자바 기초 프로그래밍 강좌 9강 - 사용자 정의 함수 ① (Java Programming Tutorial 2017 #9)
//	https://www.youtube.com/watch?v=YwSsMH8GX2A&list=PLRx0vPvlEmdBjfCADjCc41aD4G0bmdl4R&index=9

//	자바 객체지향 프로그래밍
//	이번 시간에는 먼저 사용자 정의 함수와 배열에 대해서 배운 뒤에 이어서 자바의 객체지향 프로그래밍에 대해서 공부하게 될 것입니다.
//	객체지행 프로그래밍에 익숙할 때 손쉽게 다양한 프로그램을 개발할 수 있게 됩니다.
//	나아가 이후에 다양한 동적 웹 애플리케이션을 구현할 때에도 JSP와 같은 자바 기반의 프로그래밍을 할 수 있습니다.
//	이 때도 객체지향 프로그래밍의 장점을 살린 MVC 모델을 이용한 구축이 이루어집니다.
//	무엇보다도 현실 세계의 다양한 사물을 컴퓨터 내부의 언어로 표현하고 그것을 활용할 수 있다는 점에서 자바 객체지향 프로그래밍은 아주 활용도가 높은 프로그래밍 기법이라고 할 수 있습니다.
//	※ 객체지향 : 객체는 일반적으로 말하는 물건을 의미하며 여기서 물건은 다순한 데이터가 아니고 그 데이터의 조작 방법에 대한 정보
//	또한 포함하고 있어 그것을 대상으로 다루는 수법을 객체 지향이라고 합니다.
	
//	학습내용
//	1. 사용자 정의 함수
//	다양한 사용자 정의 함수를 알아봅니다.
//	2. 반복 함수와 재귀 함수
//	반복 함수와 재귀 함수의 차이점을 이해하고 이를 활용합니다.
//	3. 배열
//	배열의 기본적인 사용법을 알아봅니다.
//	4. 다차원 배열
//	다차원의 배열을 정의하여 다양한 문제를 해결합니다.
//	5. 클래스
//	클래스의 기본적인 개념을 알아봅니다.
//	6. 상속
//	클래스의 상속에 대해서 알아봅니다.
	
//	사용자 정의 함수
//	만들어 보기
//	사용자 정의 함수는 정해진 특정한 기능을 수행하는 모듈을 의미하며 함수를 적절히 활용하면 하나의 문제를 잘게 분해할 수 있습니다.
//	예를 들어 이진 탐색트리 삽입, 삭제, 순회 들 다양한 함수의 집합으로 구성됩니다.
//	만약 사용자 정의 함수가 없다면 오직 메인 함수에서 모든 알고리즘을 처리해야 하는데 이는 작업의 효율성을 저하시킬 수 있습니다.
//	또한 함수는 각각의 모듈로서 쉽게 수정되고 보완될 수 있다는 장점이 있습니다.
	
//	사용자 정의함수
//	만들어 보기
//	사용자 정의 함수를 이용해서 다양한 프로그램을 작성합니다.
//	- 3개의 수 최대 공약수를 찾는 프로그램을 작성합니다.
//	- 약수 중 K번째로 작은 수를 찾는 프로그램을 작성합니다.
//	- 문자열에서 마지막 단어를 반환하는 함수를 작성합니다.
//	- max()를 이용하여 최대값을 저장하는 프로그램을 작성합니다.
}
