
public class Index {

//	자바 기초 프로그래밍 강좌 10강 - 사용자 정의 함수 ② (Java Programming Tutorial 2017 #10)
//	https://www.youtube.com/watch?v=RwYK9UkP8-0&list=PLRx0vPvlEmdBjfCADjCc41aD4G0bmdl4R&index=10

//	사용자 정의 함수
//	만들어 보기
//	사용자 정의 함수는 정해진 특정한 기능을 수행하는 모듈을 의미하며 함수를 적절히 활용하면 하나의 문제를 잘게 분해할 수 있습니다.
//	예를 들어 이진 탐색트리 삽입, 삭제, 순회 들 다양한 함수의 집합으로 구성됩니다.
//	만약 사용자 정의 함수가 없다면 오직 메인 함수에서 모든 알고리즘을 처리해야 하는데 이는 작업의 효율성을 저하시킬 수 있습니다.
//	또한 함수는 각각의 모듈로서 쉽게 수정되고 보완될 수 있다는 장점이 있습니다.

//	사용자 정의함수
//	만들어 보기
//	사용자 정의 함수를 이용해서 다양한 프로그램을 작성합니다.
//	- 3개의 수 최대 공약수를 찾는 프로그램을 작성합니다.
//	- 약수 중 K번째로 작은 수를 찾는 프로그램을 작성합니다.
//	- 문자열에서 마지막 단어를 반환하는 함수를 작성합니다.
//	- max()를 이용하여 최대값을 저장하는 프로그램을 작성합니다.
	
}
