
public class Index {
	
//	자바 기초 프로그래밍 강좌 13강 - 배열 (Java Programming Tutorial 2017 #13)
//	https://www.youtube.com/watch?v=SByN3m_8Nr4&list=PLRx0vPvlEmdBjfCADjCc41aD4G0bmdl4R&index=13
//
//	배열
//	데이터가 많을 때
//	배열은 쉽게 말해 데이터가 많을 때 사용하는 것입니다.
//	가장 간단한 프로그램 예제에서는 단순히 한 두개의 변수만으로 프로그램을 작동시킬 수 있엇지만 
//	현실에서의 다양한 프로그램에는 아주 많은 양의 데이터가 사용되는 것이 일반적입니다.
//	따라서 데이터가 많을 때 주로 배열을 이용할 수 있습니다.
//	이 때 배열은 한없이 많을 수 있으면서도 그 데이터 개수가 변경될 수 있는 데이터들의 집합을 지정해줄 수 있기에 효과적으로 대부분의 프로그램에 사용됩니다.

	
//		┌───┐───┐───┐───┐───┐───┐───┐───┐───┐───┐
//		│	│	│	│	│	│	│	│	│	│	│
//		└───┘───┘───┘───┘───┘───┘───┘───┘───┘───┘
//	 arr [0] [1] [2] [3] [4] [5] [6] [7] [8] [9] 
	
//	배열
//	데이터가 많을 때
//	배열을 적절히 사용하여 많은 데이터를 처리합니다.
//	- 원하는 개수만큼의 배열 생성 및 최댓값 구하는 프로그램을 작성합니다.
//	- 100개의 랜덤 정수의 평균을 구하는 프로그램을 작성합니다.
	
	
}
