
public class Index {

//	자바 기초 프로그래밍 강좌 15강 - 클래스 (Java Programming Tutorial 2017 #15)
//	https://www.youtube.com/watch?v=4idO8VOr17o&list=PLRx0vPvlEmdBjfCADjCc41aD4G0bmdl4R&index=15
	
//	클래스
//	객체 지향의 기본
//	클래스는 객체 지향 프로그래밍에 있어서 가장 기본이 되는 것입니다.
//	클래스를 이용하여 현실 세계의 특정한 물건을 지칭할 수 있습니다.
//	대표적으로 많이 사용되는 것이 Node 클래스입니다.
//	이는 하나의 장소나 위치를 의미할 수도 있으며 자료 구조에서 말하는 이진 탐색 트리의 하나의 서브 트리가 될 수도 있습니다.
//	또한 개발 프로젝트에서는 종종 Student 클래스 와 같이 하나의 데이터 단위를 명시하는데 사용이 됩니다.
	
//	클래스
//	객체 지향의 기본
//	클래스에 대한 개념을 바르게 이해하고 이를 활용합니다.
//	- 하나의 점을 의미하는 Node 클래스를 생성할 수 있습니다.
//	- Node 클래스를 이용하여 두 점 사이의 중점을 구하는 프로그램을 작성합니다.
}
