
public class Index {
	
//	자바 기초 프로그래밍 강좌 6강 - 조건문 & 반복문 ② (Java Programming Tutorial 2017 #6)
//	https://www.youtube.com/watch?v=x47Oll7WHJY&list=PLRx0vPvlEmdBjfCADjCc41aD4G0bmdl4R&index=6

//	여기서 잠깐!
//	헷갈리는 연산자
//	- i++와 ++i는 단순히 값을 증가시키려는 목적이라면 그 기능이 동일합니다.
//	- 100 < x < 200은 잘못된 표현입니다.
//	   ( 100 < x ) && ( x < 200 )로 표현하는 것이 올바른 연산 식 표현입니다.
//	- i++는 i+=과 동일한 표현입니다. 
//	  또한 i = i + 1과도 동일한 표현입니다.
//	  모두 1만큼 증가시킨다는 의미를 가지고 있습니다.

//	조건문 & 반복문
//	논리의 흐름
//	조건문과 반복문은 프로그래밍에 있어서 논리의 흐름을 정하는 가장 기본적인 기술입니다.
//	조건문은 쉽게 말해 조건에 따라 결정을 내리는 것을 말합니다.
//	학점을 결정할 때 90점 이상이면 A+이라고 하는 것도 조건문에 해당합니다.
//	반복문은 반복적으로 같은 처리를 되풀이하는 것을 말합니다.
//	예를 들어 100명의 학생이 있을 때 학생 각각의 학점을 출력하려고 한다면 100명의 학점 출력 코드를 모두 작성하는 것은 비효율적입니다.
//	따라서 반복문을 이용하여 그러한 과정을 대신할 수 있는 것입니다.
//	조건문과 반목문의 문법은 처음에는 복잡해 보이지만 익숙해지면 아주 간단합니다.

//	조건문 & 반복문
//	논리의 흐름
//	조건문과 반복문을 제대로 학습해야 프로그래밍을 잘할 수 있습니다.
//	- if문을 이용하여 문자열이 특정 문자열을 포함하는지 확인하는 프로그램을 작성합니다.
//	- 점수에 따라서 다른 메세지를 출력하는 프로그램을 작성해봅시다.
//	- 문자열과 정수형을 각각 조건문을 잉용해 활용해보고 그 차이점을 공부합니다.
//	- while을 이용하여 1부터 1000까지의 합을 출력하는 프로그램을 작성해봅시다.
//	- for문을 이용하여 삼각형을 출력하는 프로그램을 작성해봅시다.
//	- for문을 이용하여 원을 출력하는 프로그램을 작성해봅시다.
	
//	여기서 잠깐!
//	조건문 & 반복문
//	- 하나의 비교 연산자는 true 혹은 false를 반환하게 됩니다.
//	- 모든 조건문 반복문에서는 왠만하면 무조건 괄호를 적용하세요
//	- for문 혹은 while문은 얼마든지 중첩될 수 있습니다.
//	- for(;;)는 while(true)와 똑같이 무한 루프라는 의미로 동작합니다.
//	- break;를 이용하여 반복문을 즉시 빠져나올 수 있습니다.

}
