
public class index {

//	자바 기초 프로그래밍 강좌 1강 - Hello World! (Java Programming Tutorial 2017 #1)
//	https://www.youtube.com/watch?v=wjLwmWyItWI&list=PLRx0vPvlEmdBjfCADjCc41aD4G0bmdl4R

//	자바 기초 프로그래밍
//	첫번째 수업은 자바 프로그래밍에 관한 것 입니다.
//	국내의 대부분 통합 프로젝트가 자바로 구현되고 있을 만큼 자바는 현재 주력 언어로써 부상하게 되었습니다.
//	특히 웹에서는 JSP, 모바일에서는 안드로이드가 아주 높은 점유율을 가지고 있다는 점을 생각해보면 자바는 현재 사용되는 대부분의 
//	시스템 개발의 기본이 되는 프로그래밍 언어라고 할 수 있는 것 입니다.
//	자바는 동일한 프로그램이 운영체제를 가리지 않고 생행이 되는 특징이 있으며
//	C++과 같이 대표적인 객체 지향 프로그래밍 언어 입니다.
//	따라서 이번 시간에는 자바를 설치하고 자바 개발을 도와주는 대표적인 개발 환경인 이클립스(Eclipse) IDE를 설치해보도록 하겠습니다.
//	✨이클립스(Eclipse) : 넷빈즈(NetBeans)와 같이 자바 개발을 할 때 가장 많이 사용되는 총합 개발 환경입니다.

//	학습내용
//	1. 자바 개발 환경 설치
//	자바 개발 환경인 이클립스(Eclipse)를 설치 합니다.
//	2. 변수
//	변수의 설정 및 사용하는 방법을 알아봅니다.
//	3. 자료형
//	다양한 자료형에 대해서 알아봅니다.
//	4. 연산자
//	다양한 연산자에 대해서 알아봅니다.
//	5. 조건문 & 반복문
//	논리적 흐름의 기본적인 조건문과 반복문을 알아봅니다.
//	6/ 기본 입출력
//	자바의 기본적인 입출력 방식을 알아봅니다.

//	자바 개발 환경 설치
//	기초 자바 개발 환경인 JDK를 설치 합니다.
//	JDK
//	설치하기
//	JDK는 자바의 기본적인 개발을 가능하게 해주는 개발 환경입니다.
//	http://www.oracle.com/technetwork/java/javase/downloads/index.html
//	공식 사이트에 접속하여 JDK를 가운로드 할 수 있습니다.
//	설치를 할 때는 SE 개발 키트를 선택하여 자신의 운영체제에 맞는 버전을 설치하시면 됩니다.
//	또한 설치 이후에는 환경 변수 설정을 한 이후에 간단한 자바 소스 코드를 입력하여 정상적으로 작동하는지 확인 할 수 있습니다.

//	JDK
//	환경 변수 설정
//	javac 명령은 자바 파일을 컴파일하여 실행하기 위해서 필요한 명령입니다.
//	자바 JDK를 설치한 뒤에 환경 변수 설정을 제대로 하게 되면 CMD(명령프롬프트)에서 javac를 입력했을 때 정상적으로 컴파일 관련 옵션들이 출력됩니다.
//	만약에 환경 변수 설정이 되어 있지 않을 때에는 javac 기능을 인지하지 못하기 때문에 환경 변수 설정에서 결로를 지정 해주는 것이 중요합니다.
//	윈도우 64비트를 시준으로 Program -> Files -> Java -> JDK 폴더 -> bin 폴더의 경로를 저장합니다.
//	이것을 환경 변수의 스스템 변수(Path)에 세미 콜론(;)으로 구분하여 주가해주면 됩니다.
//	이렇게 되면 bin폴더 내부의 javac 프로그램을 사용할 수 있는 것입니다.
//	그리고 bin 폴더의 상위 폴더를 JAVA_HOME 시스템 변수를 만들어 그 안에 입력해주도록 합니다.
//	이는 후에 많은 작업에 용이하게 사용될 수 있습니다.

//	자바 개발 환경 설치
//	더욱 나은 개발 도구인 이클립스(Eclipse)를 설치합니다.
//	이클립스
//	설치하기
//	이클립스는 자바를 개발할 때 더욱 효율적인 개발을 가능하게 해주는 개발 환경입니다.
//	https://www.eclipse.org/downloads/ 공식 사이트에 접속하여 이클립스를 다운로드 할 수 있습니다.
//	설치를 할 때는 Java 개발자용  IDE를 선택하여 자신의 운영체제에 맞는 버전을 설치하면 됩니다.
//	(후에 웹 개발로 들어가면 Java EE를 설치하게 됩니다.)
//	설치 이후에는 간단한 자바 소스 코드를 입력하여 정상적으로 작동하는 지 확인할 수 있습니다.
	
}
