
public class index {

//	변수 관련 상식
//	- 자바에서는 변수 초기화를 하지 않으면 사용할 수 없습니다.
//	- 정수를 나타내는 타입만 해도 short, int, long으로 다양합니다.
//	-  정수 변수안에 실수를 넣으면 정수 부분만 변수에 저장됩니다.
//	- 실수 값을 반올림할 때는 변수에 0.5를 더한 뒤에 정수형으로 형변환을 하면 됩니다.
//	- 반올림한 값 = (int) (실수 + 0.5);

//	자료형
//	나에게 필요한 데이터 타입
//	자바에서는 다른 프로그래밍 언어에서 사용하는 것과 거의 동일한 자료형이 존재합니다.
//	마찬가지로 다양한 자료형이 존재하며 C언어와 두드러지는 차이점은 boolean형과 String형 정도만 있을 뿐입니다.
//	이 중에서 가장 많이 사용되는 자료형은 String, Array, boolean, char, int, double입니다.
//	자료형 자체는 굳이 암기할 필요가 없으며 프로그래밍을 통해 많은 훈련을 거치게 되면서 알아서 잘 활용할 수 있게 될 것입니다.
//	또한 문자열을 나타내는 자료형인 String형이 아주 편리하게 사용되며, String 내부적으로
//	substring등의 함수를 제공하기 때문에 활용도가 높습니다.
	
//	자료형
//	데이터 타입
//	자료형을 바르게 이해하여 다양한 프로그램을 작성할 수 있습니다.
//	- double형을 이용하여 평균을 구하는 프로그램을 작성합니다.
//	- 아스키코드 기반의 char형을 사용해 a부터 z까지 출력하는 프로그램을 작성합니다.
//	- 10진수를 8진수 혹은 16진수로 바꾸어 출력해봅니다.
//	- String의 substring 함수를 활용해봅니다.
	
}
